#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтложитьЧек_ОтложитьЧекПеред(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РезервироватьДо", ТекущаяДата() + 60 * 60 * 24);
	ДополнительныеПараметры.Вставить("ОписаниеОповещения", Неопределено); // TODO Здесь можно добавить печать чека если нужно
		
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗарезервироватьНаКлиенте",
		ЭтотОбъект,
		Новый Структура("ОповещениеПриЗавершении", Новый ОписаниеОповещения("ВопросПередЗакрытиемОперацияЗавершение", ЭтотОбъект, ДополнительныеПараметры)));
		
	// Отложить чек с резервированием
	ПоказатьВводДаты(
		ОписаниеОповещения,
		ДополнительныеПараметры.РезервироватьДо,
		НСтр("ru = 'Зарезервировать до:'"),
		ЧастиДаты.ДатаВремя);

КонецПроцедуры

#КонецОбласти

