#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЦен.Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидЦены = Выборка.Ссылка;
	КонецЕсли;
	
	BUYER     = "0000000000000";
	SUPPLIER  = "0000000000000";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьОстатки(Команда)
	
	ДатаВыгрузки = ТекущаяДата();
	
	// 1. Остатки выгружаются в XML файл в кодировке UTF-8.
	// 2. Имя файла должно быть вида STOCAT_YYYYMMDD_HHMMSS.XML
	// 3. Расширение файла XML указывать обязательно.
	ВременныйФайл = НовыйВременныйФайл();
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(ВременныйФайл, "UTF-8"); 
	Запись.ЗаписатьОбъявлениеXML(); //<?xml version="1.0" encoding="UTF-8"?>
	Запись.ЗаписатьНачалоЭлемента("STOCAT");// Stocat начало.
	
	ЗаписатьЭлементXML(Запись, "DATE", Формат(ДатаВыгрузки,"ДФ=yyyy-MM-dd"));
	ЗаписатьЭлементXML(Запись, "TIME", Формат(ДатаВыгрузки,"ДФ=HH:mm"));
	ЗаписатьЭлементXML(Запись, "STOCKDATE", Формат(ДатаВыгрузки,"ДФ=yyyy-MM-dd"));
	
	ЗаписатьЭлементXML(Запись, "INFO", Комментарий);
	
	Запись.ЗаписатьНачалоЭлемента("HEAD");// HEAD начало.
	
	ЗаписатьЭлементXML(Запись, "SUPPLIER",  SUPPLIER);
	ЗаписатьЭлементXML(Запись, "BUYER",     BUYER);
	ЗаписатьЭлементXML(Запись, "SENDER",    SUPPLIER);
	ЗаписатьЭлементXML(Запись, "RECIPIENT", BUYER);
	РассчитатьОстаткиТоваров(ДатаВыгрузки);
	ПорядковыйНомер = 1;
	Для Каждого Стр Из ОстаткиНоменклатуры Цикл
		Запись.ЗаписатьНачалоЭлемента("POSITION");// POSITION начало.
		ЗаписатьЭлементXML(Запись, "POSITIONNUMBER",    Формат(ПорядковыйНомер,"ЧГ="));
		ЗаписатьЭлементXML(Запись, "PRODUCT",           Штрихкод(Стр.ШтрихКод));
		ЗаписатьЭлементXML(Запись, "PRODUCTIDBUYER",    Стр.Артикул);
		ЗаписатьЭлементXML(Запись, "PRODUCTIDSUPPLIER", Стр.Артикул);
		ЗаписатьЭлементXML(Запись, "DESCRIPTION",       Стр.НаименованиеПолное);
		ЗаписатьЭлементXML(Запись, "UNIT",              Строка(Стр.ЕдиницаИзмерения));
		ЗаписатьЭлементXML(Запись, "STOCKQUANTITY",     Формат(Стр.Остаток, "ЧДЦ=2; ЧС=; ЧРД=.; ЧН=0.00; ЧГ="));
		ЗаписатьЭлементXML(Запись, "PRICE",             Формат(Стр.Цена, "ЧДЦ=2; ЧС=; ЧРД=.; ЧН=0.00; ЧГ="));
		ЗаписатьЭлементXML(Запись, "NETPRICE",          Формат(Стр.ЦенаБезНДС, "ЧДЦ=2; ЧС=; ЧРД=.; ЧН=0.00; ЧГ="));
		ЗаписатьЭлементXML(Запись, "VAT",               Формат(Стр.СтавкаНДСЧислом, "ЧДЦ=2; ЧС=; ЧРД=.; ЧН=0.00; ЧГ="));
		Запись.ЗаписатьКонецЭлемента();// POSITION конец.
		ПорядковыйНомер = ПорядковыйНомер + 1;
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();// HEAD конец.
	
	Запись.ЗаписатьКонецЭлемента();// Stocat конец.
	
	Запись.Закрыть();
	
	// Передача файла на FTP
	ПутьКСерверу = "ftpport.1edi.ru";
	Пользователь = "2901000013800";
	Пароль = "68741259745";
	ИмяКаталога = "/in/stocat";
	
	FTPСоединение = Новый FTPСоединение(ПутьКСерверу,21,Пользователь, Пароль);
	FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);
	ИмяФайла = "STOCAT_" + Формат(ДатаВыгрузки,"ДФ=yyyyMMdd") + "_" + Формат(ДатаВыгрузки,"ДФ=hhmmss") + ".xml";
	FTPСоединение.Записать(ВременныйФайл, ИмяФайла);
	
	НачатьУдалениеФайлов(,ВременныйФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	
	СохранитьНастройкиВФайлНаСервере("\\1c\1CData\НастройкиВыгрузкиВотОнЯ.xml");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НовыйВременныйФайл()

	Возврат ПолучитьИмяВременногоФайла();

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаписатьЭлементXML(ЗаписьXML, ИмяЭлемента, ЗначениеЭлемента)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписьXML.ЗаписатьТекст(СокрЛП(ЗначениеЭлемента));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьОстаткиТоваров(ДатаВыгрузки)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаВыгрузки",      ДатаВыгрузки);
	СтруктураПараметров.Вставить("Склад",             Склад);
	СтруктураПараметров.Вставить("ВидЦены",           ВидЦены);
	СтруктураПараметров.Вставить("ОтборНоменклатуры", ОтборНоменклатуры);
	
	ТаблицаОстатков = РеквизитФормыВЗначение("Объект").ОстаткиТоваров(СтруктураПараметров);
	ОстаткиНоменклатуры.Загрузить(ТаблицаОстатков);
	
КонецПроцедуры

&НаКлиенте
Функция Штрихкод(Знач Штрихкод)
	
	Штрихкод = СокрЛП(?(ШтрихКод = Null, "", ШтрихКод));
	Возврат ?(СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Штрихкод), Штрихкод, "");
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиВФайлНаСервере(ИмяФайла)
	
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(ИмяФайла, "UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Настройки");
	ЗаписатьЭлементXML(Запись, "BUYER",             ОбщегоНазначения.ЗначениеВСтрокуXML(BUYER));
	ЗаписатьЭлементXML(Запись, "SUPPLIER",          ОбщегоНазначения.ЗначениеВСтрокуXML(SUPPLIER));
	ЗаписатьЭлементXML(Запись, "ВидЦены",           ОбщегоНазначения.ЗначениеВСтрокуXML(ВидЦены));
	ЗаписатьЭлементXML(Запись, "Склад",             ОбщегоНазначения.ЗначениеВСтрокуXML(Склад));
	ЗаписатьЭлементXML(Запись, "ОтборНоменклатуры", ОбщегоНазначения.ЗначениеВСтрокуXML(ОтборНоменклатуры));
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть();
	
КонецПроцедуры

#КонецОбласти