
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	НачалоПериода = НачалоДня(?(ЗначениеЗаполнено(Период.ДатаНачала), Период.ДатаНачала, '00010101'));
	КонецПериода = КонецДня(?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, '39991231'));
	
	Если НачалоПериода > КонецПериода Тогда
		ВызватьИсключение НСтр("ru = 'Дата начала периода не может быть больше даты окончания периода'");
	КонецЕсли;
	
	ВыполнитьОбработкуНаСервере(НачалоПериода, КонецПериода);
	
	Сообщить("Обработка завершена!");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработкуНаСервере(НачалоПериода, КонецПериода)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ВыполнитьОбработку(НачалоПериода, КонецПериода);
	
КонецПроцедуры

#КонецОбласти

