#Область ПанельДополнительнойИнформации

&НаСервере
Процедура КУТ_ПрочитатьДанныеПанелиДопИнформации()
	
	Элементы.ПанельДополнительнойИнформации.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	КрупныйШрифт = Новый Шрифт(,11);
	МелкийШрифт  = Новый Шрифт(,8);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	
	//  Остаток взаиморасчетов
	
	ЗадолженностьКонтрагента = Обработки.ЗадолженностьПартнеров.ЗадолженностьКонтрагента(Объект.Ссылка);
	
	Элементы.ОстатокВзаиморасчетовКлиент.Заголовок = Обработки.ЗадолженностьПартнеров.НадписьЗадолженностьКлиента(ЗадолженностьКонтрагента.НамДолжны);
	Элементы.ОстатокВзаиморасчетовПоставщик.Заголовок = Обработки.ЗадолженностьПартнеров.НадписьЗадолженностьПоставщика(ЗадолженностьКонтрагента.МыДолжны);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура КУТ_ПриЧтенииНаСервере(ТекущийОбъект)
	
	КУТ_ПрочитатьДанныеПанелиДопИнформации();
	
КонецПроцедуры

&НаСервере
Процедура КУТ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КУТ_ПрочитатьДанныеПанелиДопИнформации();
	
КонецПроцедуры

&НаКлиенте
Процедура КУТ_ОстатокВзаиморасчетовКлиентОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Объект;	
	
	УсловияОтбора = Новый Структура("Контрагент", ТекущиеДанные.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	
	ОткрытьФорму("Отчет.РасчетыСКлиентами.Форма", 	 ПараметрыФормы,ЭтотОбъект, ТекущиеДанные.Ссылка);  

КонецПроцедуры

&НаКлиенте
Процедура КУТ_ОстатокВзаиморасчетовПоставщикОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Объект;	
	
	УсловияОтбора = Новый Структура("Контрагент", ТекущиеДанные.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	
	ОткрытьФорму("Отчет.РасчетыСПоставщиками.Форма", ПараметрыФормы,ЭтотОбъект, ТекущиеДанные.Ссылка); 
	
КонецПроцедуры

#КонецОбласти


