
&ИзменениеИКонтроль("СкопироватьРекурсивно")
Функция Права_СкопироватьРекурсивно(Источник, ФиксироватьДанные)

	Перем Приемник;
	
	#Вставка
	// Перенесено исправление irgn из ПР в расширение. В причинах ошибки не разбирался
	УстановитьПривилегированныйРежим(Истина); 
	#КонецВставки
	ТипИсточника = ТипЗнч(Источник);

	Если ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Возврат Источник.Скопировать();
	КонецЕсли;

	Если ТипИсточника = Тип("Структура")
		Или ТипИсточника = Тип("ФиксированнаяСтруктура") Тогда
		Приемник = СкопироватьСтруктуру(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Соответствие")
		Или ТипИсточника = Тип("ФиксированноеСоответствие") Тогда
		Приемник = СкопироватьСоответствие(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Массив")
		Или ТипИсточника = Тип("ФиксированныйМассив") Тогда
		Приемник = СкопироватьМассив(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = СкопироватьСписокЗначений(Источник, ФиксироватьДанные);
	Иначе
		Приемник = Источник;
	КонецЕсли;

	Возврат Приемник;

КонецФункции
