
&ИзменениеИКонтроль("ИспользуетсяККТФЗ54")
Функция Права_ИспользуетсяККТФЗ54(КассоваяСмена)

	ИспользуетсяККТФЗ54 = Ложь;

	Запрос = Новый Запрос(
	#Удаление
	"ВЫБРАТЬ
	#КонецУдаления
	#Вставка
	"ВЫБРАТЬ Разрешенные // Н.И. Исправлена ошибка
	#КонецВставки
	|	КассоваяСмена.ФискальноеУстройство.ТипОборудования КАК ТипОборудования
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Ссылка = &КассоваяСмена
	|");
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда

		ИспользуетсяККТФЗ54 = (Выборка.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ);

	КонецЕсли;

	Возврат ИспользуетсяККТФЗ54;

КонецФункции
