
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьСписокОбъектов();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокОбъектов()
	
	ОбъектыКОбмену.Добавить("Документы.РеализацияТоваровУслуг", "Реализация товаров и услуг", Истина, БиблиотекаКартинок.Документ);
	ОбъектыКОбмену.Добавить("Документы.ПоступлениеТоваровУслуг", "Поступление товаров и услуг", Истина,  БиблиотекаКартинок.Документ);
	ОбъектыКОбмену.Добавить("Документы.СчетФактураВыданный", "Счет-фактура выданный", Истина,  БиблиотекаКартинок.Документ);
	ОбъектыКОбмену.Добавить("Документы.СчетФактураПолученный", "Счет-фактура полученный", Истина,  БиблиотекаКартинок.Документ);
	ОбъектыКОбмену.Добавить("Справочник.Номенклатура", "Номенклатура", Истина,  БиблиотекаКартинок.Справочник);
	ОбъектыКОбмену.Добавить("Справочник.Контрагенты", "Контрагенты", Истина,  БиблиотекаКартинок.Справочник);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьОбъекты(Команда)
	
	ЗарегистрироватьОбъектыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьОбъектыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период.ДатаОкончания));
	Запрос.Текст = ТекстЗапросаДокументы("РеализацияТоваровУслуг");
	Выборка = Запрос.Выполнить().Выбрать();
	
	УзлыОбмена = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УзелОбмена);
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Выборка.Ссылка);
	КонецЦикла;
	
	ПараметрыОбмена = ОбменДаннымиСервер.ПараметрыОбмена();
	ПараметрыОбмена.ВидТранспортаСообщенийОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.FILE;
	ПараметрыОбмена.ВыполнятьЗагрузку = Ложь;
	ПараметрыОбмена.ВыполнятьВыгрузку = Истина;
	
	ПараметрыОбмена.ДлительнаяОперацияРазрешена = Ложь;
	ПараметрыОбмена.ДлительнаяОперация          = Ложь;
	
	Отказ = Ложь;
	ОбменДаннымиСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(УзелОбмена, ПараметрыОбмена, Отказ);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДокументы(ИмяДокумента)
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	Документ.Ссылка
	|ИЗ
	|	Документ.%1 КАК Документ
	|ГДЕ
	|	Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Документ.Организация = &Организация";
	
	Возврат СтрШаблон(ШаблонЗапроса, ИмяДокумента);
	
КонецФункции