
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьСписокОбъектов();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокОбъектов()

	ОбъектыКОбмену.Добавить("Документы.РеализацияТоваровУслуг", "Реализация товаров и услуг", Истина, БиблиотекаКартинок.Документ);
	ОбъектыКОбмену.Добавить("Документы.ПоступлениеТоваровУслуг", "Поступление товаров и услуг", Истина,  БиблиотекаКартинок.Документ);
	ОбъектыКОбмену.Добавить("Справочник.Номенклатура", "Номенклатура", Истина,  БиблиотекаКартинок.Справочник);
	
КонецПроцедуры
