
&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере()
	ОбъектОбъект = РеквизитФормыВЗначение("Объект");
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заказ);
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
	ТабличныйДокумент = ОбъектОбъект.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, СписокОбъектов, Неопределено);
	
КонецПроцедуры
