
&Перед("ПередЗаписью")
Процедура АртикулВендора_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Артикул) Тогда 
		АртикулВендора = СформироватьАртикул(Артикул); 
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьАртикул(Знач АртикулНоменклатуры, ИндексНачала = 4)
	
	КоличествоСимволов = СтрДлина(АртикулНоменклатуры) - ИндексНачала;
	АртикулНоменклатуры = СокрЛП(Сред(АртикулНоменклатуры, ИндексНачала, КоличествоСимволов + 1));
	
	ЧастиАртикулаБП = СтрРазделить(АртикулНоменклатуры, "-");
	
	АртикулБП = "";
	Для Каждого ЧастьБП Из ЧастиАртикулаБП Цикл
		АртикулБП = ?(АртикулБП = "", "", АртикулБП + "-") + ЧастьБП; 		
	КонецЦикла;
	
	Возврат АртикулБП; 

КонецФункции
