#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЦен.Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидЦеныПродажи = Выборка.Ссылка;
	КонецЕсли;
	
	BUYER     = "4660018279995";
	SUPPLIER  = "2901000013800";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьНоменклатуру(Команда)
	
	ДатаВыгрузки = ТекущаяДата();
	
	РассчитатьОстаткиТоваров(ДатаВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НовыйВременныйФайл()

	Возврат ПолучитьИмяВременногоФайла();

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаписатьЭлементXML(ЗаписьXML, ИмяЭлемента, ЗначениеЭлемента)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписьXML.ЗаписатьТекст(СокрЛП(ЗначениеЭлемента));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьОстаткиТоваров(ДатаВыгрузки)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаВыгрузки",      ДатаВыгрузки);
	СтруктураПараметров.Вставить("Склад",             Склад);
	СтруктураПараметров.Вставить("ВидЦеныПродажи",    ВидЦеныПродажи);
	СтруктураПараметров.Вставить("ВидЦеныЗакупки",    ВидЦеныЗакупки);
	СтруктураПараметров.Вставить("ОтборНоменклатуры", ОтборНоменклатуры);
	
	ТаблицаОстатков = РеквизитФормыВЗначение("Объект").ОстаткиТоваров(СтруктураПараметров);
	ОстаткиНоменклатуры.Загрузить(ТаблицаОстатков);
	
КонецПроцедуры

#КонецОбласти