#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Снято_АБ_СнятоСПроизводстваПриИзмененииПеред(Элемент)
	
	ТекстСнятоСПроизводства = ТекстСнятоСПроизводства();
	Если Объект.СнятоСПроизводства И НЕ СтрНайти(Объект.Наименование, ТекстСнятоСПроизводства) Тогда
		Объект.Наименование = Объект.Наименование + " " + ТекстСнятоСПроизводства;
	ИначеЕсли НЕ Объект.СнятоСПроизводства И СтрНайти(Объект.Наименование, ТекстСнятоСПроизводства) Тогда
		Объект.Наименование = СокрЛП(СтрЗаменить(Объект.Наименование, ТекстСнятоСПроизводства, ""));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ТекстСнятоСПроизводства()
	
	Возврат НСтр("ru='(Товар снят с производства)'");
	
КонецФункции

&НаСервере
Процедура Снято_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ПолеВвода = Элементы.Добавить("АртикулВендора",	Тип("ПолеФормы"), Элементы.ГруппаШапка);
		
	ПолеВвода.Заголовок = "Артикул вендора";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "Объект.АртикулВендора"
	
КонецПроцедуры

#КонецОбласти